docs/posts/2017-06-03-pentecost-prayer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 24, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pentecost Prayer</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Pentecost Prayer</h1>
<p class="subtitle" role="doc-subtitle">Jun 03, 2017</p>
</header><p>
A prayer for tomorrow&rsquo;s sermon at Spring Creek Baptist Church:
</p>

<p>
God of life,
</p>

<p>
Sometimes our prayers are as parched as the desert<br>
and our hearts as dry as the dunes of sand.
</p>

<p>
We take offense at things that don&rsquo;t matter,<br>
but ignore the ones that do.
</p>

<p>
When others are hungry,<br>
we are full.
</p>

<p>
When others are hurting,<br>
we are numb.
</p>

<p>
When others are cold,<br>
we rest comfortably<br>
beneath warm blankets of apathy.
</p>

<p>
But even in our self-righteousness,<br>
we still feel something,<br>
a deep ache of longing,<br>
a thirst for something<br>
greater than ourselves,<br>
a lingering thought<br>
that you are still there.<br>
</p>

<p>
Emmanuel,<br>
God with us.<br>
</p>

<p>
Despite our weakness,<br>
you have called us to be your people,<br>
ambassadors of your kingdom.
</p>

<p>
On this Pentecost Sunday,
lead us once more to the well of your grace,<br>
bathe us again in the streams of your mercy.
</p>

<p>
Open the floodgates of your love,<br>
and let the rivers flow.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 24, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
